
enum en_PACKET_TYPE
{
	////////////////////////////////////////////////////////
	//
	//	Client & Server Protocol
	//
	////////////////////////////////////////////////////////

	//=========================================================================================
	//=========================================================================================
	// Login Server
	//=========================================================================================
	//=========================================================================================
	en_PACKET_CS_LOGIN_SERVER = 1000,

	//------------------------------------------------------------
	// 로그인 서버로 클라이언트 계정 등록 요청
	//
	//	{
	//		WORD	Type
	//
	//		char	ID[40]
	//		char	PW[64]				// Hashed Password(sha256)
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_LOGIN_REQ_REGIST,


	//------------------------------------------------------------
	// 로그인 서버로 클라이언트 계정 등록 성공
	//
	//	{
	//		WORD	Type
	//		
	//		char	isSuccess (0 = fail, 1 = success)
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_LOGIN_RES_REGIST,

	//------------------------------------------------------------
	// 로그인 서버로 클라이언트 로그인 요청
	//
	//	{
	//		WORD	Type
	//
	//		char	ID[40]
	//		char	PW[64]				// Hashed Password(sha256)
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_LOGIN_REQ_LOGIN,

	//------------------------------------------------------------
	// 로그인 서버에서 클라이언트로 로그인 성공
	//
	//	{
	//		WORD	Type
	//
	//		char	isSuccess (0 = fail, 1 = success) // isSuccess = 0이라면 아래는 보내지않음
	//		INT64	AccountNo
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_SC_LOGIN_RES_LOGIN,

};



enum en_PACKET_SC_RES_FAILURE_REASON
{
	dfLOGIN_RES_FAILURE_NONE = 0,		// 미인증상태
	dfLOGIN_RES_FAILURE_GAME,			// 게임중
	dfLOGIN_RES_FAILURE_ID_PW_MISMATCH,	// ID/PW가 일치하지 않음
};


enum en_PACKET_CS_GAME_RES_LOGIN
{
	dfGAME_LOGIN_FAIL = 0,			// 세션키 오류 또는 Account 데이블상의 오류
	dfGAME_LOGIN_SUCCESS,			// 성공
	dfGAME_LOGIN_NONE_OF_TOKEN,		// 로그인 인증 토큰 부재
};
